src/InformationRegisters/ИсторияЗапросов/ИсторияЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияЗапросов</name>
  <resources>
    <name>ДатаЗапроса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Метод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПараметрыЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОбработкиЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответ</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.КлиентыХранилища</types>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИсторияЗапросов/ManagerModule.bsl
//////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция СоздатьЗаписьИстории(ПараметрыЗаписи = Неопределено) Экспорт
	
	Результат = РегистрыСведений.ИсторияЗапросов.СоздатьМенеджерЗаписи();
	Результат.Идентификатор 	= Новый УникальныйИдентификатор;
	Результат.ДатаЗапроса 		= ТекущаяДатаСеанса();
	
	Если Не ПараметрыЗаписи = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Результат, ПараметрыЗаписи);
	КонецЕсли; // Если Не ПараметрыЗаписи = Неопределено Тогда
	
	Результат.Записать();
	
	Возврат	Результат.Идентификатор;
	
КонецФункции // СоздатьЗаписьИстории

Функция ОбновитьЗапись(Идентификатор, ПараметрыЗаписи) Экспорт
	Запись 					= РегистрыСведений.ИсторияЗапросов.СоздатьМенеджерЗаписи();
	Запись.Идентификатор 	= Идентификатор;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Возврат Ложь;
	КонецЕсли; // Если Не Запись.Выбран() Тогда
	
	Для Каждого Ресурс Из Метаданные.РегистрыСведений.ИсторияЗапросов.Ресурсы Цикл
		Если ПараметрыЗаписи.Свойство(Ресурс.Имя) Тогда
			Запись[Ресурс.Имя] = ПараметрыЗаписи[Ресурс.Имя];
		КонецЕсли; // Если ПараметрыЗаписи.Свойство(Ресурс.Имя) Тогда		
	КонецЦикла; // 	Для Каждого Ресурс Из Метаданные.РегистрыСведений.ИсторияЗапросов.Ресурсы Цикл
	
	Запись.Записать();
	Возврат Истина;
КонецФункции // ОбновитьЗапись
